app/controllers/clients_controller.rb

  def find
    puts params[:search_string]
    @results = Client.where(name: params[:search_string])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."name" = ? LIMIT ?  [["name", "name"], ["LIMIT", 1]]

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "address", "current_weight", "height", "gender", "email_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @client.update(client_params)
---
UPDATE "clients" SET "gender" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["gender", "Female"], ["updated_at", "2018-05-09 03:55:24.602125"], ["id", 1]]