app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
  def index
    @workouts = Workout.all

SELECT "workouts".* FROM "workouts" WHERE "workouts"."client_name" = ?  [["client_name", "John"]]
---
    def find
        puts params[:search_string]
        @results = Workout.where(client_name: params[:search_string])

INSERT INTO "workouts" ("client_name", "trainer", "duration_mins", "date_of_workout", "paid_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @workout = Workout.new(workout_params)

    respond_to do |format|
      if @workout.save

UPDATE "workouts" SET "client_name" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["client_name", "Johnny"], ["updated_at", "2018-05-07 06:50:14.508190"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @workout.update(workout_params)

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_workout
      @workout = Workout.find(params[:id])